app/controllers/todo_items_controller.rb

	def create
		@todo_item = @todo_list.todo_items.create(todo_item_params)
---
INSERT INTO "todo_items" ("content", "created_at", "todo_list_id", "updated_at") VALUES (?, ?, ?, ?)  [["content", ""], ["created_at", "2015-12-01 15:56:19.735868"], ["todo_list_id", 2], ["updated_at", "2015-12-01 15:56:19.735868"]]

	def destroy
		if @todo_item.destroy
---
DELETE FROM "todo_items" WHERE "todo_items"."id" = ?  [["id", 1]]

	def complete
		@todo_item.update_attribute(:completed_at, Time.now)
---
UPDATE "todo_items" SET "completed_at" = ?, "updated_at" = ? WHERE "todo_items"."id" = 1  [["completed_at", "2015-12-01 15:56:34.750613"], ["updated_at", "2015-12-01 15:56:34.751173"]]

	def set_todo_list
		@todo_list = TodoList.find(params[:todo_list_id])
---
SELECT  "todo_lists".* FROM "todo_lists"  WHERE "todo_lists"."id" = ? LIMIT 1  [["id", 2]]

	def set_todo_item
		@todo_item = @todo_list.todo_items.find(params[:id])
---
SELECT  "todo_items".* FROM "todo_items"  WHERE "todo_items"."todo_list_id" = ? AND "todo_items"."id" = ? LIMIT 1  [["todo_list_id", 2], ["id", 1]]