app/controllers/todo_lists_controller.rb

SELECT "todo_lists".* FROM "todo_lists"   ORDER BY created_at DESC
---
  def index
    @todo_lists = TodoList.all.order('created_at DESC')

INSERT INTO "todo_lists" ("created_at", "description", "title", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2015-12-01 00:38:16.366405"], ["description", ""], ["title", "Do the group project"], ["updated_at", "2015-12-01 00:38:16.366405"]]
---
  def create
    @todo_list = TodoList.new(todo_list_params)

    respond_to do |format|
      if @todo_list.save

UPDATE "todo_lists" SET "title" = ?, "updated_at" = ? WHERE "todo_lists"."id" = 2  [["title", "Final project for NYCDA Project"], ["updated_at", "2015-12-01 15:56:02.955325"]]
---
  def update
    respond_to do |format|
      if @todo_list.update(todo_list_params)

SELECT  "todo_lists".* FROM "todo_lists"  WHERE "todo_lists"."id" = ? LIMIT 1  [["id", 2]]
---
    def set_todo_list
      @todo_list = TodoList.find(params[:id])